/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

#include	"STC32G_Exti.h"

//========================================================================
//                               本地变量声明
//========================================================================

u8 WakeUpSource;

//========================================================================
// 函数: INT0_ISR_Handler
// 描述: INT0中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT0_ISR_Handler (void) interrupt INT0_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	P00 = ~P00;
	WakeUpSource = 1;
}

//========================================================================
// 函数: INT1_ISR_Handler
// 描述: INT1中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT1_ISR_Handler (void) interrupt INT1_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	P01 = ~P01;
	WakeUpSource = 2;
}

//========================================================================
// 函数: INT2_ISR_Handler
// 描述: INT2中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT2_ISR_Handler (void) interrupt INT2_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	P02 = ~P02;
	WakeUpSource = 3;
}

//========================================================================
// 函数: INT3_ISR_Handler
// 描述: INT3中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT3_ISR_Handler (void) interrupt INT3_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	P03 = ~P03;
	WakeUpSource = 4;
}

//========================================================================
// 函数: INT4_ISR_Handler
// 描述: INT4中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2020-09-23
//========================================================================
void INT4_ISR_Handler (void) interrupt INT4_VECTOR		//进中断时已经清除标志
{
	// TODO: 在此处添加用户代码
//	P04 = ~P04;
	WakeUpSource = 5;
}
